Repository: NurzhauganovA/test_project_registry
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: kk, ru

source: Appointment with ID: %(ID)s not found.
kk: %(ID)s нөмірлі қабылдау табылмады.
ru: Приём с ID: %(ID)s не найден.

source: Associated schedule is inactive or not found.
kk: Тиісті кесте белсенді емес немесе табылмады.
ru: Расписание неактивно или не найдено.

source: New appointment date is outside of schedule period.
kk: Жаңа қабылдау күні кесте мерзімінен тыс.
ru: Новая дата приема выходит за рамки расписания.

source: No schedule day available for this date.
kk: Бұл күнге кесте күні қосылмаған.
ru: На эту дату нет добавленных дней расписания.

source: The specialist does not support the provided patient type.
ru: Специалист с этим расписанием не обслуживает указанный тип пациентов.

source: The specialist does not support the referral type.
ru: Специалист с этим расписанием не обслуживает указанный тип направлений.

source: The specialist does not support the referral origin type.
ru: Специалист с этим расписанием не обслуживает указанный тип источника направления.

source: The specialist does not support the provided insurance type.
ru: Специалист с этим расписанием не обслуживает указанный тип страхования.

source: The specialist with ID: %(ID) not found.
ru: Специалист с указанным ID: %(ID) не найден.

source: The selected appointment slot is already booked.
kk: Таңдалған уақыт аралығы қазірдің өзінде брондалған.
ru: Выбранный интервал времени уже забронирован.

source: The appointment cannot overlap with the break time.
kk: Қабылдау маманның үзіліс/түскі уақытымен сәйкес келмеуі тиіс. Басқа уақыт таңдаңыз.
ru: Приём не может совпадать со временем перерыва/обеда специалиста. Пожалуйста, выберите другое время.

source: Schedule with ID: %(ID)s not found.
kk: %(ID)s нөмірлі кесте табылмады.
ru: Расписание с ID: %(ID)s не найдено.

source: The schedule is inactive.
kk: Кесте белсенді емес.
ru: Расписание не активно.

source: Appointment date is outside the schedule period.
kk: Қабылдау күні кесте мерзімінен тыс.
ru: Дата приёма вне срока действия расписания.

source: No active schedule day available for the given date.
kk: Көрсетілген күнге белсенді кесте күні жоқ.
ru: На указанную дату нет доступных активных дней расписания.

source: Schedule day with ID %(id)s not found.
kk: %(id)s нөмірлі кесте күні табылмады.
ru: День расписания с ID: %(id)s не найден.

source: The schedule day is inactive.
kk: Кесте күні белсенді емес.
ru: День расписания неактивен.

source: Selected time %(start_time)s for %(appointment_interval)d-minute appointment is outside working hours (%(work_start_time)s–%(work_end_time)s).
ru: Выбранное время - %(start_time)s для приёма, длительностью %(appointment_interval)s минут назначено вне рабочего времени (%(work_start_time)s–%(work_end_time)s).

source: Schedule for day ID %(ID)s not found.
ru: Расписание на день с идентификатором: %(ID)s не найдено.

source: Schedule day with ID %(ID)s not found.
ru: Расписание дня с идентификатором %(ID)s не найдено.

source: Doctor with ID: %(ID)s not found.
ru: Врач с идентификатором: %(ID)s не найден.

source: Schedule day %(id)s is inactive.
ru: День расписания %(id)s неактивен.

source: Invalid appointment status. You can't select an 'appointment' status without 'patient_id' provided.
ru: Неверный статус приёма. Статус 'appointment' нельзя установить без указания 'patient_id'.

source: Invalid appointment status. You can't select an 'booked' status with 'patient_id' provided.
ru: Неверный статус приёма. Статус 'booked' нельзя установить при наличии 'patient_id'.

source: Schedule name cannot exceed 20 characters.
kk: Кесте атауы 20 таңбадан аспауы тиіс.
ru: Название расписания не может превышать 20 символов.

source: Schedule description cannot exceed 256 characters.
ru: Описание/примечание расписания не может превышать 256 символов.

source: New schedule end date cannot be earlier than new start date.
ru: Новая дата окончания расписания не может быть раньше новой даты начала.

source: New schedule period exceeds the maximum allowed period of: %(MAX_VALUE)s days.
ru: Новый период расписания превышает максимально допустимый период: %(MAX_VALUE)s дней.

source: Schedule with ID: %(ID) not found.
kk: %(ID)s нөмірлі кесте табылмады.
ru: Расписание с ID: %(ID) не найдено.

source: New schedule end date cannot be earlier than existing schedule start date.
kk: Жаңа кестенің аяқталу күні қолданыстағы кестенің басталу күнінен ерте болмауы керек.
ru: Новая дата окончания расписания не может быть раньше даты начала существующего расписания.

source: New period must be within the boundaries of the existing schedule period.
kk: Жаңа мерзім қолданыстағы кесте мерзімінің шегінде болуы тиіс.
ru: Новый период должен находиться в пределах границ существующего периода расписания.

source: Schedule period exceeds the maximum allowed period of: %(MAX_VALUE)s days.
ru: Период действия графика превышает максимально допустимое количество дней: %(MAX_VALUE)s.

source: Schedule with name: '%(NAME)s' for this specialist is already taken.
ru: Наименование графика: '%(NAME)s' для данного специалиста уже занято.

source: Cannot update schedule. Cannot remove day with ID: %(ID)s because active appointments exist.
kk: Кестені жаңарту мүмкін емес. Себебі %(ID)s нөмірлі күні бар белсенді қабылдаулар бар.
ru: Невозможно обновить расписание. Невозможно удалить день с ID: %(ID)s, поскольку существуют активные приёмы.

source: Cannot update day with ID: %(ID)s. Active appointments exist.
kk: %(ID)s нөмірлі күнді жаңарту мүмкін емес. Белсенді қабылдаулар бар.
ru: Невозможно обновить день с ID: %(ID)s. Существуют активные приёмы.

source: User with ID: %(ID)s not found or not a doctor.
kk: %(ID)s нөмірлі қолданушы табылмады немесе дәрігер емес.
ru: Пользователь с ID: %(ID)s не найден или не является доктором.

source: Appointment interval must be equal to or greater than 5 and less than or equal to 60 minutes.
ru: Интервал приёма должен быть равен или больше 5 и меньше или равен 60 минутам.

source: Schedule creation for a user with the provided set of client roles is prohibited.
ru: Создание расписания для пользователя с набором переданных ролей запрещено.

source: Day with ID: %(ID)s not found.
kk: %(ID)s нөмірлі күн табылмады.
ru: День с ID: %(ID)s не найден.

source: Cannot deactivate day with ID: %(ID)s — active appointments exist.
kk: %(ID)s нөмірлі күнді белсенді емес ету мүмкін емес — белсенді қабылдаулар бар.
ru: Невозможно деактивировать день с ID: %(ID)s — существуют активные приёмы.

source: New working hours %(new_start)s-%(new_end)s do not cover all active appointments.
kk: Жаңа жұмыс уақыты %(new_start)s-%(new_end)s барлық белсенді қабылдауларды қамтымайды.
ru: Новые рабочие часы %(new_start)s-%(new_end)s не охватывают все активные приёмы.

source: Break time %(EFFECTIVE_BS)s-%(EFFECTIVE_BE)s conflicts with an active %(APPT_INTERVAL)s minutes appointment at %(APPT_TIME)s with ID: %(APPT_ID)s.
kk: Үзіліс уақыты %(EFFECTIVE_BS)s-%(EFFECTIVE_BE)s %(APPT_TIME)s уақытында %(APPT_INTERVAL)s минуттық %(APPT_ID)s нөмірлі белсенді қабылдаумен сәйкес келеді.
ru: Время перерыва %(EFFECTIVE_BS)s-%(EFFECTIVE_BE)s конфликтует с активной %(APPT_INTERVAL)s минутным приёмом в %(APPT_TIME)s с ID: %(APPT_ID)s.

source: Cannot delete day with ID: %(ID)s and date: %(DATE)s — active appointments exist.
kk: %(ID)s нөмірлі және %(DATE)s күнді өшіру мүмкін емес — белсенді қабылдаулар бар.
ru: Невозможно удалить день с ID: %(ID)s и датой: %(DATE)s — существуют активные приёмы.

source: Something went wrong. Please, try again later.
kk: Бірдеңе дұрыс болмады. Кейінірек қайталап көріңіз.
ru: Что-то пошло не так. Пожалуйста, попробуйте позже.

source: Access denied. You're not allowed to proceed this operation.
kk: Қолжетімсіз. Бұл операцияны орындауға құқығыңыз жоқ.
ru: Отказано в доступе. У вас недостаточно прав для выполнения данной операции.

source: IIN must be exactly 12 digits.
kk: ЖСН дәл 12 саннан тұруы керек.
ru: ИИН должен состоять из 12 цифр.

source: No active attachments found for this specialist.
kk: Бұл маман үшін белсенді тіркемелер табылмады.
ru: Для этого специалиста не найдено активных прикреплений.

source: %(FIELD)s must not be empty.
kk: %(FIELD)s бос болмауы керек.
ru: %(FIELD)s не может быть пустым.

source: Date of birth cannot be in the future.
kk: Туған күні болашақта болмауы тиіс.
ru: Дата рождения не может быть в будущем.

source: Client roles must be provided as a list.
kk: Клиент рөлдері тізім түрінде берілуі тиіс.
ru: Клиентские роли должны быть предоставлены в виде списка.

source: Duplicate roles are not allowed.
kk: Қайталанатын рөлдерге рұқсат етілмейді.
ru: Дублирование клиентских ролей не допускается.

source: User with ID: %(ID)s not found.
kk: %(ID)s нөмірлі қолданушы табылмады.
ru: Пользователь с ID: %(ID)s не найден.

source: User with ID: %(ID)s already exists.
kk: %(ID)s нөмірлі қолданушы бұрыннан бар.
ru: Пользователь с ID: %(ID)s уже существует.

source: User with IIN: %(IIN)s already exists.
kk: %(IIN)s ЖСН-і бар қолданушы бұрыннан бар.
ru: Пользователь с ИИН: %(IIN)s уже существует.

source: Couldn't handle an event. Unsupported action type: '%(ACTION)s'.
kk: Kafka-дан event өңделмеді. Рұқсат етілмеген операция түрі: '%(ACTION)s'.
ru: Не удалось обработать event из Kafka. Приведён недопустимый тип операции (action type): '%(ACTION)s'.

source: Field 'lang' must be '%(DEFAULT_LANG)s.'
ru: Поле 'lang' должно быть '%(DEFAULT_LANG)s.'

source: Citizenship with ID: %(ID)s not found.
ru: Гражданство с ID: '%(ID)s' не найдено.

source: Citizenship with country code: '%(COUNTRY_CODE)s' already exists.
ru: Гражданство с кодом страны: '%(COUNTRY_CODE)s' уже существует.

source: Nationality with ID: %(ID)s not found.
ru: Национальность с ID: '%(ID)s' не найдена.

source: Given nationality name (RU): '%(NAME)s' is already taken.
ru: Переданное имя национальности (РУС): '%(NAME)s' уже занято.

source: Given nationality name (EN): '%(NAME)s' is already taken.
ru: Переданное имя национальности (АНГЛ): '%(NAME)s' уже занято.

source: Given nationality name (KZ): '%(NAME)s' is already taken.
ru: Переданное имя национальности (КАЗ): '%(NAME)s' уже занято.

source: Patient context attribute with ID: %(ATTR_ID)s was not found.
ru: Дополнительный признак пациента с ID: %(ATTR_ID)s не найден.

source: Attribute with name: '%(NAME)s' already exists.
ru: Дополнительный признак пациента с именем: '%(NAME)s' уже существует.

source: Attribute's '%(CODE)s' locale: '%(VALUE)s' already exists in some record's locale. It's already taken.
ru: Локаль '%(CODE)s' со значением '%(VALUE)s' уже используется в другой записи. Она уже занята.

source: Attribute with id: %(ID)s not found.
ru: Дополнительный признак пациента с id: %(ID)s не найден.

source: Financing source with ID: %(SRC_ID)s was not found.
ru: Источник финансирования с ID: %(SRC_ID)s не найден.

source: Financing source with name: '%(NAME)s' already exists.
ru: Источник финансирования с именем: '%(NAME)s' уже существует.

source: Financing source with code: '%(SRC_CODE)s' already exists.
ru: Источник финансирования с кодом: '%(SRC_CODE)s' уже существует.

source: Financing source's '%(CODE)s' locale: '%(VALUE)s' already exists in some record's locale. It's already taken.
ru: Локаль источника финансирования '%(CODE)s' со значением '%(VALUE)s' уже используется в другой записи. Она уже занята.

source: Financing source with id: %(ID)s not found.
ru: Источник финансирования с id: %(ID)s не найден.

source: Medical organization with ID: %(ORG_ID)s was not found.
ru: Медицинская организация с ID: %(ORG_ID)s не найдена.

source: Medical organization with id: %(ID)s not found.
ru: Медицинская организация с id: %(ID)s не найдена.

source: Medical organization with name: '%(NAME)s' already exists.
ru: Медицинская организация с именем: '%(NAME)s' уже существует.

source: Medical organization with internal code: '%(ORG_CODE)s' already exists.
ru: Медицинская организация с внутренним кодом: '%(ORG_CODE)s' уже существует.

source: Medical organization's '%(CODE)s' name locale: '%(VALUE)s' already exists in some record's name locale. It's already taken.
ru: Локализованное имя организации ('%(CODE)s': '%(VALUE)s') уже используется в другой записи. Это значение уже занято.

source: Medical organization's '%(CODE)s' locale: '%(VALUE)s' already exists in some record's locale. It's already taken.
ru: Локаль ('%(CODE)s': '%(VALUE)s') медицинской организации уже используется в другой записи. Это значение уже занято.

source: Citizenship with ID: %(ATTR_ID)s was not found.
ru: Гражданство с ID: %(ATTR_ID)s не найдено.

source: Citizenship with name: '%(NAME)s' already exists.
ru: Гражданство с именем: '%(NAME)s' уже существует.

source: Citizenship with country code: '%(CODE)s' already exists.
ru: Гражданство с кодом страны: '%(CODE)s' уже существует.

source: Citizenship's '%(CODE)s' locale: '%(VALUE)s' already exists in some record's locale. It's already taken.
ru: Локаль '%(CODE)s' со значением '%(VALUE)s' уже используется в другой записи. Она уже занята.

source: Platform rule with ID: '%(ID)s' not found.
ru: Бизнес-правило платформы с ID: '%(ID)s' не найдено.

source: Platform rule with key: '%(KEY)s' already exists.
ru: Бизнес-правило платформы с ключом (key): '%(KEY)s' уже существует.

source: Patient with ID: '%(ID)s' not found.
ru: Пациент с ID: '%(ID)s' не найден.

source: Patient with IIN: '%(IIN)s' not found.
ru: Пациент с ИИН: '%(IIN)s' не найден.

source: Patient with IIN: '%(IIN)s' already exists.
ru: Пациент с ИИН: '%(IIN)s' уже существует.

source: 'valid_till' date must be equal or greater than 'valid_from' date.
ru: Дата, переданная в поле 'valid_till' должна быть больше или равна дате в поле 'valid_from'.

source: Insurance info record with ID: %(ID)s was not found.
ru: Запись страхования с ID: %(ID)s не найдена.

source: The schedule period must not exceed 3 months.
kk: Кесте мерзімі 3 айдан аспауы керек.

source: At least one payment type must be selected.
kk: Кемінде бір төлем түрі таңдалуы қажет (МӘМС, ЕМС және т.б.).

source: At least one referral type must be selected.
kk: Кемінде бір жазылу көзі таңдалуы керек (Өзіндік жазылу, Сыртқы ұйым).

source: The schedule does not support the provided insurance type.
kk: Бұл кесте бойынша көрсетілген сақтандыру түрі қызмет көрсетпейді.

source: Selected time from %(st)s for %(ai)s minutes appointment is outside working hours (%(ws)s–%(we)s).
kk: Таңдалған уақыт — %(st)s, қабылдау ұзақтығы %(ai)s минут, жұмыс уақытының (%(ws)s–%(we)s) шегінен тыс тағайындалған.

source: Schedule overlaps with an existing one. Please, adjust the dates.
kk: Кесте бар кестемен сәйкес келеді. Даталарды түзетіңіз.

source: Cannot delete schedule. Active appointments exist.
kk: Кестені өшіру мүмкін емес. Белсенді қабылдаулар бар.

source: Cannot deactivate schedule. Active appointments exist.
kk: Кестені белсенді емес ету мүмкін емес. Белсенді қабылдаулар бар.

source: Cannot delete day with ID: %(ID)s — active appointments exist.
kk: %(ID)s нөмірлі күнді өшіру мүмкін емес — белсенді қабылдаулар бар.

source: Cannot change appointment interval for day with ID: %(ID)s because it has active appointments.
kk: %(ID)s нөмірлі күнге арналған қабылдау интервалын өзгерту мүмкін емес, себебі сол күнде белсенді қабылдаулар бар.
